import React, { Component } from 'react';
import { connect } from 'dva';
import { Form } from 'antd';
import styles from './Register.less';


@connect(({ register, messagecode, loading }) => ({
  register,
  messagecode,
  submitting: loading.effects['register/submit'],
}))
@Form.create()
class Register extends Component {
  state = {

  };


  componentDidMount() {

  }



  render() {
    return (
      <div className={styles.fuwumain}>
        <h1>服务协议</h1>
        <div>
          <p>欢迎使用公司产品及服务！</p>
          <b> 一、缔约主体</b>
          <p>          本协议是由公司网站、移动客户端及其他方式的用户（以下简称“用户”或“您”）与北京一元集成科技有限公司（以下简称“公司”）就公司龙神OI办公平台（以下简称“系统”）的使用等相关事宜所签订的协议，请用户在点击“同意”按钮之前，详细阅读本协议，用户可以选择不接受该协议条款，但用户点击“同意”按钮并提交后，依据《中华人民共和国合同法》《中华人民共和国电信条例》《互联网信息服务管理办法》等相关法律法规的规定，本协议即构成合法有效、对双方具有约束力的法律文件。
          </p>
<b>          二、协议的内容
</b>
          <p>          1、本平台提供的各项服务的所有权及运营权归公司享有，您在注册完成后，即视为已经充分阅读并理解了本协议约定的条款，对标黑加粗的部分，再次提醒您重点阅读。
          </p>
          <p>          2、在注册之前，请您确认同意该协议条款，如果您不同意本协议内容或对本协议内容有异议，请您立即停止注册。
          </p>
          <p>          3、当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，本协议即产生法律约束力。您承诺接受并遵守本协议的约定，届时您不应以未阅读本协议的内容或者未获得公司对您问询的解答等理由，主张本协议无效，或要求撤销本协议。
          </p>
<b>          三、用户注册
</b>
          <p>          1、用户保证提供的注册信息（包括但不限于个人信息、公司信息等）真实、及时、完整和准确。如果信息有变动，用户应及时通知本平台或在本平台上进行修改，若用户未及时通知或提供注册的信息不真实、不准确、不合法，由此产生的一切法律责任及后果（包括本平台的损失）均由用户自行承担。
          </p>
          <p>          2、您了解并同意，公司注册账号所有权归属于公司，注册完成后，您仅获得账号使用权。公司账号使用权仅归属于初始申请注册人，不得以任何方式转让或被提供予他人使用，否则，公司有权立即不经通知收回该账号，由此带来的因您使用本服务产生的全部数据、信息等被清空、丢失等的损失，您应自行承担。
          </p>
          <p>          3、用户注册成功后，将产生用户名及密码等用户信息，用户有更改密码的权利。用户应当妥善、谨慎的保管和使用账号信息，并对利用该账号和密码所进行的一切活动（包括但不限于网上点击同意或购买服务、分享信息或图片等）负全部责任，不得利用该账号从事违法犯罪或侵犯他人合法权益的行为。您承诺，在密码或账号遭到未获授权的使用，或者发生其他任何安全问题时，将立即通知公司，且您同意并确认，公司不对上述情形产生的任何直接或间接的遗失或损害承担责任。除非有法律规定或司法裁定，且征得公司的同意，否则，您的账号、密码不得以任何方式转让、赠与或继承（与账号相关的财产权益除外）。
          </p>
          <p>          4、未经本平台同意，用户不得将注册成功的账号提供给其他方使用，否则由此产生的法律责任，由注册用户与实际使用人承担连带责任。
          </p>
          <p>          5、若本平台有理由相信用户正在利用本平台从事违法活动，或依据司法行政机关的法律文书或命令，本平台有权依法进行相应的证据保全。
          </p>
          <p>          6、对于试用版用户，如您注册公司账号后，连续超过12个月未登录，公司为网站优化管理之目的有权回收该账号，相关问题及责任均由您自行承担。
          </p>
          <p>          7、公司根据本协议收回或取消账号后，有权自行对账号相关内容及信息以包括但不限于删除等方式进行处理，且无需就此向免费版用户承担任何责任。
          </p>
<b>          四、用户责任
</b>
          <p>          1、根据《中华人民共和国电信条例》《互联网信息服务管理办法》《中华人民共和国计算机信息网络国际联网管理暂行规定》《中华人民共和国计算机信息系统安全保护条例》及本平台的相应规则，用户不得利用本平台制作、发布、传播含有下列内容的信息：
          </p>
          <p>          a、反对宪法所确定的基本原则的；
          </p>
          <p>          b、危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
          </p>
          <p>          c、损害国家荣誉和利益的；
          </p>
          <p>          d、煽动民族仇恨、民族歧视，破坏民族团结的；
          </p>
          <p>          e、破坏国家宗教政策，宣扬邪教和封建迷信的；
          </p>
          <p>          f、散布谣言，扰乱社会秩序，破坏社会稳定的；
          </p>
          <p>          g、散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
          </p>
          <p>          h、侮辱或者诽谤他人，侵害他人合法权益的；
          </p>
          <p>          i、含有法律、行政法规禁止的其他内容的；
          </p>
          <p>          2、用户不得从事干扰本平台的正常运转，非法侵入本平台及国家计算机信息系统的行为，不得利用本平台注册的账号进行非法牟利经营。
          </p>
          <p>          3、用户不得滥用公司平台的通信功能发送垃圾信息。
          </p>
          <p>          4、用户必须为自己注册账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对使用本服务时接触到的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。公司无法且不会对您因前述风险而导致的任何损失或损害承担责任。
            若用户违反本条规定，本平台将依据《中华人民共和国侵权责任法》等相关法律、法规的规定，立即独立采取有效措施停止提供服务、关闭注销账号，由此产生的一切后果由用户自行承担。
          </p>
          <p>          5、对于免费版用户，在公司服务提供过程中，公司及其关联公司或其授权单位和个人有权以各种方式投放各种商业性广告或其他任何类型的推广信息，同时，您同意接受以电子邮件或其他方式向您发送的上述广告或推广信息。
          </p>
<b>          五、本平台服务
</b>
          <p>          1、本平台提供互联网办公服务及相关软件、硬件的服务，提供的服务会随着公司的经营而不断调整和变化，平台将持续不断的升级，平台升级不需征得您的同意。
          </p>
          <p>          2、公司承诺在有用户数据因服务器存储设备损坏时以最快的速度从最近的备份中恢复数据，但无法承诺100％的数据恢复，对因公司原因造成的数据丢失或损失，公司按不超过用户所交服务费的标准予以补偿。公司将全力确保用户数据安全，公司对于非由公司故意或重大过失导致的用户数据丢失或泄露不承担任何附带、间接、惩罚性、特殊的责任，除非法律或有权机关另有规定。
          </p>
          <p>          3、对于用户自行在本平台上传或发布的信息，本平台不负责实质性的审查。若在本平台上发布的信息有虚假、违法、侵权等情形的，均由发布者自行承担，本平台不承担任何的责任。但若出现上述情况，用户可及时通知本平台，经本平台查实后，本平台将依照相关法律、法规的规定采取屏蔽、注销、停止服务等措施。
          </p>
          <b>          六、费用及支付
          </b>

          <p>          1、公司的用户收费标准以公司网站最新公布的内容为准。用户需要按照本平台公布的价格支付服务费后，公司为您开通服务。
          </p>
          <p>          2、公司有权根据实际情况调整费用标准及收费方式，并公示于公司网站，但调整日前已经订购本服务并已全额支付服务费用的用户在相应的服务期内不受影响。
          </p>
          <p>          3、除非本协议另有约定，用户在成功购买本服务后，所支付的服务费用均不做退返。在下列情况下,公司同意将用户订购费用中的剩余款项进行退返，退款款项不计利息并以人民币形式支付：
          </p>
          <p>          ①非因用户违约原因，公司在用户订购后无理由终止向该用户提供服务；
          </p>
          <p>          ②为保护用户权益，公司另行规定的情况。
          </p>

          <b>          七、第三方应用
          </b>
          <p>          1、为了您能有更好的体验，公司允许第三方应用接入公司平台，您可以在公司平台直接获得第三方应用服务，您还可能受限于该等第三方的相关条款和条件。您了解并同意，公司仅是平台提供者，相关应用由该等第三方独立提供，公司不对您对该应用的使用，承担任何责任，本服务条款不影响您与该第三方的法律关系。
          </p>
          <p>          2、您了解并同意，公司有权对第三方应用服务或部分服务做出调整，中止或终止第三方应用服务，公司不承担任何责任。
          </p>
          <b>          八、责任限制条款
          </b>
          <p>          1、对于用户自行发布的信息，用户应当保证该信息的真实、合法性，本平台作为办公平台，无法控制该信息，若出现违法信息而产生的一切法律责任均由发布者自行承担，与本平台无涉，给本平台造成损失的，本平台将依法追究其相应的法律责任。
          </p>
          <p>          2、无论在何种情况下，对Internet连接故障、电脑、通讯及其它系统故障、IDC故障、信息传输故障、黑客进攻、电力故障、罢工、社会事件、自然灾害、国际、国内法院的命令和任何第三方不作为等不可预见、不可避免、不可克服的因素所造成的不能提供服务或迟延提供服务，本平台不承担任何责任。
          </p>
          <p>          3、您充分了解并同意，基于互联网的公司平台需要定期或不定期地对提供网络服务的平台设备、软硬件进行检修或者维护，如因此类情况而造成平台收费服务在合理时间内的中断，公司无需为此承担任何责任，但公司应尽可能事先进行通告。
          </p>
          <p>          4、公司努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您存储在公司平台中的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到信息的员工也采取了严格的管理措施，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。公司会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，公司将在任何时候尽力做到使您的信息不被泄漏、毁损或丢失，但同时也请您注意在信息网络上不存在绝对完善的安全措施，请妥善保管好相关信息。
          </p>
          <p>          5、您充分了解并同意，鉴于互联网的特殊性，您在服务中分享的信息及个人资料有可能会被他人复制、转载、擅改或做其它非法用途；您在此已充分意识此类风险的存在，并确认此等风险应完全由您自行承担，公司对此不承担任何责任。
          </p>
          <p>          6、您了解并同意，在使用服务过程中可能存在来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）及匿名或冒名的信息的风险，基于服务使用规范所述，该等风险应由您自行承担，公司对此不承担任何责任。
          </p>
          <p>          7、您同意，如因公司的原因，造成公司平台不正常中断或其它技术故障，则您所获赔偿的最高限额应不超过您在对应的服务期间内已支付给公司的服务费用。
          </p>
          <b>          九、保密及披露
          </b>
          <p>          1、除本协议另有约定外，本平台保证不对外公开或向第三方提供用户的注册资料及用户在使用本平台服务时存储在本平台上合法、非公开内容，但下列情况除外：
          </p>
          <p>          a、事先获得用户的明确授权的。
          </p>
          <p>          b、根据有关的法律法规要求，本平台必须提供的。
          </p>
          <p>          c、按照相关政府主管部门或司法部门的要求，本平台必须提供的。
          </p>
          <p>          d、用户先行违反本协议内容造成本平台、他人或社会公共利益可能遭受损害的，本平台有权向相关当事人提供用户的相关信息。
          </p>


<b>          十、协议终止，中止
</b>
          <p>          1、鉴于互联网的特殊性，本平台有权中止或终止免费版用户的服务，本平台不需提前发出公告。
          </p>
          <p>          2、出现下列情况时，本平台有权决定终止提供服务，并终止本协议：
          </p>
          <p>          a、用户提供的信息不真实、不合法或不及时更新。
          </p>
          <p>          b、利用本平台从事违法、犯罪活动的。
          </p>
          <p>          c、被本平台注销用户、终止服务的。
          </p>
          <p>          d、本平台修改或更新服务协议，用户不同意或不接受的。
          </p>
          <p>          e、本协议另有规定或本平台认为需要终止的其他情形。
          </p>
          <p>          3、本协议终止后，用户同意本平台继续享有下述权利：
          </p>
          <p>          a、在服务期间存在违法或违反本协议的行为，本平台可依据本协议主张权利。
          </p>
          <p>          b、法律、行政法规规定的及合同约定的其他情况。
          </p>


          <b>          十一、通知与维权
          </b>

          <p>          1、用户在使用本平台服务时，若发现本平台内容有违反法律、法规的规定或侵犯他人合法权益（包括但不限于肖像权、姓名权、名誉权、知识产权等），或用户认为相关信息侵犯了自身的合法权益，用户应当如实向本平台告知并提交下列材料：
          </p>
          <p>          a、涉嫌侵权信息的具体内容及位置、链接等。
          </p>
          <p>          b、自身享有合法权益的证明。
          </p>
          <p>          c、自身联系人姓名、地址、电话号码或电子邮件。
          </p>
          <p>          d、身份证复印件或营业执照复印件。
          </p>
          <p>          2、本平台将在在收到该材料后，经审查属实的，本平台将尽快删除相关信息。
          </p>
          <p></p>
          <p></p>


          <b>          十二、法律适用与管辖
          </b>

            <p>          本协议之效力、解释、执行与争议解决均适用中华人民共和国大陆地区法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。用户与本平台一致同意，若因履行本协议而产生的争议，双方本着友好协商解决，协商不成的，双方同意提交本平台运营公司注册地有管辖权的人民法院诉讼解决。
            </p>
          <p>          本平台再次重申，在注册成为本平台用户之前，请仔细、详尽的阅读本协议，对协议中加粗标黑的部分，因关系用户自身的责任与义务，请着重阅读。一经注册，用户应严格遵守该协议的所有条款，本平台有权根据经营的需要随时修改本协议，对于修改后的协议，用户可随时查阅。若用户对修订后的协议有异议，请及时联系本平台或停止使用本平台服务。
          </p>
        </div>
      </div>
    );
  }
}

export default Register;
